data/ycsb/workloada/75AS1014T9HW/workloada_30/transactions_round2.dat
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:rocksdb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /tmp/ycsb-rocksdb/YCSB/rocksdb/conf:/tmp/ycsb-rocksdb/YCSB/rocksdb/target/rocksdb-binding-0.16.0-SNAPSHOT.jar:/home/ljishen/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/ljishen/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/ljishen/.m2/repository/org/rocksdb/rocksdbjni/5.14.3/rocksdbjni-5.14.3.jar:/home/ljishen/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/tmp/ycsb-rocksdb/YCSB/core/target/core-0.16.0-SNAPSHOT.jar:/home/ljishen/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/ljishen/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/home/ljishen/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/ljishen/.m2/repository/org/slf4j/slf4j-log4j12/1.7.25/slf4j-log4j12-1.7.25.jar:/home/ljishen/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P /tmp/ycsb-rocksdb/data/output_myworkloada/myworkloada -p rocksdb.dir=/mnt/sdb1/ycsb-rocksdb-data -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P /tmp/ycsb-rocksdb/data/output_myworkloada/myworkloada -p rocksdb.dir=/mnt/sdb1/ycsb-rocksdb-data -t
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
0      [      Thread-20] INFO  .ycsb.db.rocksdb.RocksDBClient  - RocksDB data dir: /mnt/sdb1/ycsb-rocksdb-data
2018-10-25 23:55:51:254 0 sec: 0 operations; est completion in 0 second 
319    [      Thread-20] INFO  .ycsb.db.rocksdb.RocksDBClient  - Load column families: [default, usertable] from options file: OPTIONS-045369
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-10-25 23:56:01:226 10 sec: 1803 operations; 180.3 current ops/sec; est completion in 4 hours 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=932, Max=996863, Min=11, Avg=149037.37, 90=378111, 99=747007, 99.9=956415, 99.99=996863] [SYS_LOAD_AVG: Count=1, Max=17, Min=17, Avg=17, 90=17, 99=17, 99.9=17, 99.99=17] [GCS: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] [USED_MEM_MB: Count=1, Max=186, Min=186, Avg=186, 90=186, 99=186, 99.9=186, 99.99=186] [UPDATE: Count=874, Max=800767, Min=51, Avg=143511.19, 90=354815, 99=620543, 99.9=777727, 99.99=800767] [GCS_TIME: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] 
2018-10-25 23:56:11:226 20 sec: 4148 operations; 234.5 current ops/sec; est completion in 3 hours 29 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=1173, Max=899071, Min=11, Avg=131936.57, 90=380671, 99=646655, 99.9=775167, 99.99=899071] [SYS_LOAD_AVG: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] [GCS: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] [USED_MEM_MB: Count=1, Max=191, Min=191, Avg=191, 90=191, 99=191, 99.9=191, 99.99=191] [UPDATE: Count=1169, Max=807935, Min=47, Avg=126881.51, 90=356351, 99=638975, 99.9=769023, 99.99=807935] [GCS_TIME: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] 
2018-10-25 23:56:21:227 30 sec: 7922 operations; 377.4 current ops/sec; est completion in 2 hours 44 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=1855, Max=722431, Min=6, Avg=77159.18, 90=219263, 99=452607, 99.9=585215, 99.99=722431] [SYS_LOAD_AVG: Count=1, Max=23, Min=23, Avg=23, 90=23, 99=23, 99.9=23, 99.99=23] [GCS: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] [USED_MEM_MB: Count=1, Max=191, Min=191, Avg=191, 90=191, 99=191, 99.9=191, 99.99=191] [UPDATE: Count=1919, Max=947711, Min=43, Avg=77785.55, 90=217855, 99=491775, 99.9=657919, 99.99=947711] [GCS_TIME: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] 
2018-10-25 23:56:31:226 40 sec: 20523 operations; 1260.1 current ops/sec; est completion in 1 hour 24 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=6303, Max=747519, Min=4, Avg=24306.48, 90=68991, 99=274175, 99.9=566783, 99.99=714239] [SYS_LOAD_AVG: Count=1, Max=27, Min=27, Avg=27, 90=27, 99=27, 99.9=27, 99.99=27] [GCS: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] [USED_MEM_MB: Count=1, Max=196, Min=196, Avg=196, 90=196, 99=196, 99.9=196, 99.99=196] [UPDATE: Count=6325, Max=1150975, Min=35, Avg=24811.8, 90=74367, 99=258303, 99.9=492031, 99.99=821247] [GCS_TIME: Count=1, Max=0, Min=0, Avg=0, 90=0, 99=0, 99.9=0, 99.99=0] 
2018-10-25 23:56:41:226 50 sec: 117084 operations; 9656.1 current ops/sec; est completion in 17 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=48195, Max=825343, Min=3, Avg=3127.67, 90=5587, 99=38367, 99.9=267775, 99.99=509439] [SYS_LOAD_AVG: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] [GCS: Count=1, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] [USED_MEM_MB: Count=1, Max=162, Min=162, Avg=162, 90=162, 99=162, 99.9=162, 99.99=162] [UPDATE: Count=48339, Max=647167, Min=31, Avg=3030.35, 90=5543, 99=34815, 99.9=259711, 99.99=509695] [GCS_TIME: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] 
2018-10-25 23:56:51:227 60 sec: 231888 operations; 11480.4 current ops/sec; est completion in 10 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=57477, Max=992255, Min=3, Avg=2524.7, 90=3381, 99=27951, 99.9=334079, 99.99=585727] [SYS_LOAD_AVG: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] [GCS: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] [USED_MEM_MB: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] [UPDATE: Count=57327, Max=770047, Min=32, Avg=2642.74, 90=3507, 99=31151, 99.9=325375, 99.99=508415] [GCS_TIME: Count=1, Max=15, Min=15, Avg=15, 90=15, 99=15, 99.9=15, 99.99=15] 
2018-10-25 23:57:01:226 70 sec: 387132 operations; 15524.4 current ops/sec; est completion in 6 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=77177, Max=623103, Min=3, Avg=1962.68, 90=2711, 99=23471, 99.9=235007, 99.99=417535] [SYS_LOAD_AVG: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] [GCS: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] [USED_MEM_MB: Count=1, Max=164, Min=164, Avg=164, 90=164, 99=164, 99.9=164, 99.99=164] [UPDATE: Count=78213, Max=689663, Min=30, Avg=1967.09, 90=2767, 99=23999, 99.9=225791, 99.99=403711] [GCS_TIME: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] 
2018-10-25 23:57:11:226 80 sec: 465778 operations; 7864.6 current ops/sec; est completion in 6 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=39262, Max=812543, Min=3, Avg=3812.52, 90=1980, 99=119167, 99.9=410111, 99.99=601087] [SYS_LOAD_AVG: Count=1, Max=30, Min=30, Avg=30, 90=30, 99=30, 99.9=30, 99.99=30] [GCS: Count=1, Max=9, Min=9, Avg=9, 90=9, 99=9, 99.9=9, 99.99=9] [USED_MEM_MB: Count=1, Max=158, Min=158, Avg=158, 90=158, 99=158, 99.9=158, 99.99=158] [UPDATE: Count=39245, Max=806911, Min=31, Avg=3757.19, 90=2046, 99=102271, 99.9=412159, 99.99=716799] [GCS_TIME: Count=1, Max=12, Min=12, Avg=12, 90=12, 99=12, 99.9=12, 99.99=12] 
2018-10-25 23:57:21:227 90 sec: 527546 operations; 6176.8 current ops/sec; est completion in 5 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=30918, Max=1261567, Min=3, Avg=4550.01, 90=10415, 99=58495, 99.9=291839, 99.99=1112063] [SYS_LOAD_AVG: Count=1, Max=30, Min=30, Avg=30, 90=30, 99=30, 99.9=30, 99.99=30] [GCS: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] [USED_MEM_MB: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] [UPDATE: Count=30994, Max=1285119, Min=30, Avg=5218.93, 90=11031, 99=60575, 99.9=425215, 99.99=1144831] [GCS_TIME: Count=1, Max=9, Min=9, Avg=9, 90=9, 99=9, 99.9=9, 99.99=9] 
2018-10-25 23:57:31:226 100 sec: 620626 operations; 9308 current ops/sec; est completion in 5 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=46401, Max=857599, Min=3, Avg=3058.55, 90=5439, 99=44159, 99.9=248959, 99.99=459519] [SYS_LOAD_AVG: Count=1, Max=31, Min=31, Avg=31, 90=31, 99=31, 99.9=31, 99.99=31] [GCS: Count=1, Max=4, Min=4, Avg=4, 90=4, 99=4, 99.9=4, 99.99=4] [USED_MEM_MB: Count=1, Max=112, Min=112, Avg=112, 90=112, 99=112, 99.9=112, 99.99=112] [UPDATE: Count=46528, Max=734719, Min=32, Avg=3378.42, 90=5507, 99=46847, 99.9=297215, 99.99=610303] [GCS_TIME: Count=1, Max=9, Min=9, Avg=9, 90=9, 99=9, 99.9=9, 99.99=9] 
2018-10-25 23:57:41:226 110 sec: 741270 operations; 12064.4 current ops/sec; est completion in 4 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=60125, Max=734207, Min=3, Avg=2458.49, 90=3793, 99=38815, 99.9=245503, 99.99=517887] [SYS_LOAD_AVG: Count=1, Max=31, Min=31, Avg=31, 90=31, 99=31, 99.9=31, 99.99=31] [GCS: Count=1, Max=8, Min=8, Avg=8, 90=8, 99=8, 99.9=8, 99.99=8] [USED_MEM_MB: Count=1, Max=45, Min=45, Avg=45, 90=45, 99=45, 99.9=45, 99.99=45] [UPDATE: Count=60692, Max=684543, Min=32, Avg=2510.35, 90=3757, 99=37983, 99.9=263679, 99.99=489471] [GCS_TIME: Count=1, Max=65, Min=65, Avg=65, 90=65, 99=65, 99.9=65, 99.99=65] 
2018-10-25 23:57:51:226 120 sec: 909456 operations; 16818.6 current ops/sec; est completion in 3 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=84186, Max=603135, Min=3, Avg=1705.9, 90=1318, 99=28303, 99.9=258687, 99.99=417791] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=11, Min=11, Avg=11, 90=11, 99=11, 99.9=11, 99.99=11] [USED_MEM_MB: Count=1, Max=84, Min=84, Avg=84, 90=84, 99=84, 99.9=84, 99.99=84] [UPDATE: Count=83827, Max=680447, Min=32, Avg=1834.22, 90=1550, 99=27055, 99.9=253823, 99.99=446207] [GCS_TIME: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] 
2018-10-25 23:58:01:226 130 sec: 1018080 operations; 10862.4 current ops/sec; est completion in 3 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=54349, Max=650239, Min=3, Avg=2597.47, 90=2125, 99=56287, 99.9=312575, 99.99=538111] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=19, Min=19, Avg=19, 90=19, 99=19, 99.9=19, 99.99=19] [USED_MEM_MB: Count=1, Max=72, Min=72, Avg=72, 90=72, 99=72, 99.9=72, 99.99=72] [UPDATE: Count=54275, Max=731647, Min=32, Avg=2847.64, 90=2303, 99=64959, 99.9=312575, 99.99=634879] [GCS_TIME: Count=1, Max=26, Min=26, Avg=26, 90=26, 99=26, 99.9=26, 99.99=26] 
2018-10-25 23:58:11:227 140 sec: 1170385 operations; 15230.5 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=75666, Max=719871, Min=3, Avg=1968.84, 90=981, 99=39935, 99.9=260095, 99.99=491775] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=15, Min=15, Avg=15, 90=15, 99=15, 99.9=15, 99.99=15] [USED_MEM_MB: Count=1, Max=48, Min=48, Avg=48, 90=48, 99=48, 99.9=48, 99.99=48] [UPDATE: Count=76639, Max=629247, Min=31, Avg=1997.83, 90=1297, 99=37535, 99.9=240383, 99.99=406527] [GCS_TIME: Count=1, Max=21, Min=21, Avg=21, 90=21, 99=21, 99.9=21, 99.99=21] 
2018-10-25 23:58:21:226 150 sec: 1184902 operations; 1451.7 current ops/sec; est completion in 3 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=7187, Max=824319, Min=3, Avg=20364.84, 90=71615, 99=316415, 99.9=567807, 99.99=675839] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=19, Min=19, Avg=19, 90=19, 99=19, 99.9=19, 99.99=19] [USED_MEM_MB: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [UPDATE: Count=7330, Max=808959, Min=31, Avg=20486.73, 90=74687, 99=326399, 99.9=607231, 99.99=776703] [GCS_TIME: Count=1, Max=27, Min=27, Avg=27, 90=27, 99=27, 99.9=27, 99.99=27] 
2018-10-25 23:58:31:226 160 sec: 1246804 operations; 6190.2 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=30851, Max=610303, Min=3, Avg=4974.85, 90=4647, 99=138751, 99.9=355583, 99.99=536575] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] [USED_MEM_MB: Count=1, Max=59, Min=59, Avg=59, 90=59, 99=59, 99.9=59, 99.99=59] [UPDATE: Count=31051, Max=709631, Min=31, Avg=4849.51, 90=4459, 99=129279, 99.9=342271, 99.99=574463] [GCS_TIME: Count=1, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] 
2018-10-25 23:58:41:227 170 sec: 1457991 operations; 21118.7 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=105293, Max=521727, Min=3, Avg=1339.24, 90=708, 99=26767, 99.9=174463, 99.99=334335] [SYS_LOAD_AVG: Count=1, Max=33, Min=33, Avg=33, 90=33, 99=33, 99.9=33, 99.99=33] [GCS: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] [USED_MEM_MB: Count=1, Max=79, Min=79, Avg=79, 90=79, 99=79, 99.9=79, 99.99=79] [UPDATE: Count=106136, Max=539135, Min=30, Avg=1516.35, 90=1021, 99=26543, 99.9=187903, 99.99=324095] [GCS_TIME: Count=1, Max=10, Min=10, Avg=10, 90=10, 99=10, 99.9=10, 99.99=10] 
2018-10-25 23:58:51:226 180 sec: 1595988 operations; 13799.7 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=69061, Max=437247, Min=3, Avg=2167.55, 90=575, 99=68415, 99.9=211199, 99.99=327423] [SYS_LOAD_AVG: Count=1, Max=33, Min=33, Avg=33, 90=33, 99=33, 99.9=33, 99.99=33] [GCS: Count=1, Max=21, Min=21, Avg=21, 90=21, 99=21, 99.9=21, 99.99=21] [USED_MEM_MB: Count=1, Max=91, Min=91, Avg=91, 90=91, 99=91, 99.9=91, 99.99=91] [UPDATE: Count=68694, Max=402175, Min=31, Avg=2146.76, 90=943, 99=62047, 99.9=198527, 99.99=331775] [GCS_TIME: Count=1, Max=31, Min=31, Avg=31, 90=31, 99=31, 99.9=31, 99.99=31] 
2018-10-25 23:59:01:226 190 sec: 1615039 operations; 1905.1 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=9549, Max=726015, Min=3, Avg=15372.93, 90=39551, 99=275199, 99.9=467967, 99.99=598015] [SYS_LOAD_AVG: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [GCS: Count=1, Max=14, Min=14, Avg=14, 90=14, 99=14, 99.9=14, 99.99=14] [USED_MEM_MB: Count=1, Max=97, Min=97, Avg=97, 90=97, 99=97, 99.9=97, 99.99=97] [UPDATE: Count=9502, Max=697343, Min=32, Avg=15787.59, 90=48287, 99=273919, 99.9=468735, 99.99=600063] [GCS_TIME: Count=1, Max=17, Min=17, Avg=17, 90=17, 99=17, 99.9=17, 99.99=17] 
2018-10-25 23:59:11:226 200 sec: 1627158 operations; 1211.9 current ops/sec; est completion in 2 minutes [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=6039, Max=1087487, Min=3, Avg=24101.96, 90=48287, 99=501759, 99.9=837631, 99.99=968703] [SYS_LOAD_AVG: Count=1, Max=34, Min=34, Avg=34, 90=34, 99=34, 99.9=34, 99.99=34] [GCS: Count=1, Max=3, Min=3, Avg=3, 90=3, 99=3, 99.9=3, 99.99=3] [USED_MEM_MB: Count=1, Max=16, Min=16, Avg=16, 90=16, 99=16, 99.9=16, 99.99=16] [UPDATE: Count=6080, Max=1088511, Min=30, Avg=24806.22, 90=42015, 99=526335, 99.9=761343, 99.99=978943] [GCS_TIME: Count=1, Max=5, Min=5, Avg=5, 90=5, 99=5, 99.9=5, 99.99=5] 
2018-10-25 23:59:21:226 210 sec: 1712921 operations; 8576.3 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=42490, Max=806399, Min=3, Avg=3544.56, 90=3077, 99=76927, 99.9=294911, 99.99=700927] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=1, Min=1, Avg=1, 90=1, 99=1, 99.9=1, 99.99=1] [USED_MEM_MB: Count=1, Max=57, Min=57, Avg=57, 90=57, 99=57, 99.9=57, 99.99=57] [UPDATE: Count=43290, Max=758271, Min=31, Avg=3644.08, 90=3239, 99=78911, 99.9=282879, 99.99=635903] [GCS_TIME: Count=1, Max=2, Min=2, Avg=2, 90=2, 99=2, 99.9=2, 99.99=2] 
2018-10-25 23:59:31:227 220 sec: 1817727 operations; 10480.6 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=52398, Max=823807, Min=3, Avg=2772.48, 90=1231, 99=51455, 99.9=353791, 99.99=629247] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=11, Min=11, Avg=11, 90=11, 99=11, 99.9=11, 99.99=11] [USED_MEM_MB: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] [UPDATE: Count=52391, Max=935423, Min=30, Avg=2843.88, 90=1687, 99=55935, 99.9=308735, 99.99=762879] [GCS_TIME: Count=1, Max=15, Min=15, Avg=15, 90=15, 99=15, 99.9=15, 99.99=15] 
2018-10-25 23:59:41:226 230 sec: 1931956 operations; 11422.9 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=57321, Max=796671, Min=3, Avg=2665.39, 90=378, 99=62719, 99.9=329727, 99.99=602111] [SYS_LOAD_AVG: Count=1, Max=37, Min=37, Avg=37, 90=37, 99=37, 99.9=37, 99.99=37] [GCS: Count=1, Max=14, Min=14, Avg=14, 90=14, 99=14, 99.9=14, 99.99=14] [USED_MEM_MB: Count=1, Max=87, Min=87, Avg=87, 90=87, 99=87, 99.9=87, 99.99=87] [UPDATE: Count=56908, Max=823295, Min=31, Avg=2641.15, 90=1051, 99=59871, 99.9=276735, 99.99=519167] [GCS_TIME: Count=1, Max=21, Min=21, Avg=21, 90=21, 99=21, 99.9=21, 99.99=21] 
2018-10-25 23:59:51:226 240 sec: 2055883 operations; 12392.7 current ops/sec; est completion in 1 minute [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=61788, Max=1050623, Min=3, Avg=2344.14, 90=198, 99=56639, 99.9=251903, 99.99=701439] [SYS_LOAD_AVG: Count=1, Max=37, Min=37, Avg=37, 90=37, 99=37, 99.9=37, 99.99=37] [GCS: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] [USED_MEM_MB: Count=1, Max=79, Min=79, Avg=79, 90=79, 99=79, 99.9=79, 99.99=79] [UPDATE: Count=62139, Max=829439, Min=29, Avg=2473.55, 90=923, 99=55135, 99.9=272383, 99.99=704511] [GCS_TIME: Count=1, Max=24, Min=24, Avg=24, 90=24, 99=24, 99.9=24, 99.99=24] 
2018-10-26 00:00:01:226 250 sec: 2157180 operations; 10129.7 current ops/sec; est completion in 53 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=50692, Max=839679, Min=3, Avg=2774.1, 90=141, 99=85311, 99.9=244991, 99.99=776191] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=23, Min=23, Avg=23, 90=23, 99=23, 99.9=23, 99.99=23] [USED_MEM_MB: Count=1, Max=59, Min=59, Avg=59, 90=59, 99=59, 99.9=59, 99.99=59] [UPDATE: Count=50605, Max=845311, Min=31, Avg=3160.2, 90=806, 99=88895, 99.9=278783, 99.99=839679] [GCS_TIME: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] 
2018-10-26 00:00:11:226 260 sec: 2277692 operations; 12051.2 current ops/sec; est completion in 39 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=60543, Max=835583, Min=3, Avg=2514.87, 90=143, 99=64991, 99.9=272895, 99.99=711679] [SYS_LOAD_AVG: Count=1, Max=36, Min=36, Avg=36, 90=36, 99=36, 99.9=36, 99.99=36] [GCS: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] [USED_MEM_MB: Count=1, Max=61, Min=61, Avg=61, 90=61, 99=61, 99.9=61, 99.99=61] [UPDATE: Count=59969, Max=835583, Min=31, Avg=2474.28, 90=744, 99=62207, 99.9=264447, 99.99=712191] [GCS_TIME: Count=1, Max=29, Min=29, Avg=29, 90=29, 99=29, 99.9=29, 99.99=29] 
2018-10-26 00:00:21:226 270 sec: 2382207 operations; 10451.5 current ops/sec; est completion in 26 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=52259, Max=1818623, Min=3, Avg=2823.77, 90=165, 99=50591, 99.9=372479, 99.99=1764351] [SYS_LOAD_AVG: Count=1, Max=34, Min=34, Avg=34, 90=34, 99=34, 99.9=34, 99.99=34] [GCS: Count=1, Max=18, Min=18, Avg=18, 90=18, 99=18, 99.9=18, 99.99=18] [USED_MEM_MB: Count=1, Max=25, Min=25, Avg=25, 90=25, 99=25, 99.9=25, 99.99=25] [UPDATE: Count=52308, Max=1815551, Min=31, Avg=2924.07, 90=766, 99=52895, 99.9=368639, 99.99=1705983] [GCS_TIME: Count=1, Max=24, Min=24, Avg=24, 90=24, 99=24, 99.9=24, 99.99=24] 
2018-10-26 00:00:31:226 280 sec: 2417384 operations; 3517.7 current ops/sec; est completion in 23 seconds [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=17584, Max=529407, Min=3, Avg=8545.9, 90=155, 99=194815, 99.9=350207, 99.99=417535] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=14, Min=14, Avg=14, 90=14, 99=14, 99.9=14, 99.99=14] [USED_MEM_MB: Count=1, Max=93, Min=93, Avg=93, 90=93, 99=93, 99.9=93, 99.99=93] [UPDATE: Count=17541, Max=507135, Min=32, Avg=8368.91, 90=258, 99=196351, 99.9=364543, 99.99=475903] [GCS_TIME: Count=1, Max=20, Min=20, Avg=20, 90=20, 99=20, 99.9=20, 99.99=20] 
2018-10-26 00:00:41:227 290 sec: 2545368 operations; 12798.4 current ops/sec; est completion in 8 second [THREAD_COUNT: Count=1, Max=32, Min=32, Avg=32, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=63960, Max=517887, Min=3, Avg=2337.26, 90=117, 99=58015, 99.9=271615, 99.99=500735] [SYS_LOAD_AVG: Count=1, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=1, Max=6, Min=6, Avg=6, 90=6, 99=6, 99.9=6, 99.99=6] [USED_MEM_MB: Count=1, Max=43, Min=43, Avg=43, 90=43, 99=43, 99.9=43, 99.99=43] [UPDATE: Count=64143, Max=689663, Min=30, Avg=2394.57, 90=500, 99=53887, 99.9=286975, 99.99=471039] [GCS_TIME: Count=1, Max=10, Min=10, Avg=10, 90=10, 99=10, 99.9=10, 99.99=10] 
2018-10-26 00:00:46:733 295 sec: 2611239 operations; 11961.32 current ops/sec; [THREAD_COUNT: Count=2, Max=32, Min=2, Avg=17, 90=32, 99=32, 99.9=32, 99.99=32] [READ: Count=32839, Max=529407, Min=3, Avg=1500.9, 90=128, 99=27743, 99.9=233087, 99.99=450559] [SYS_LOAD_AVG: Count=2, Max=35, Min=35, Avg=35, 90=35, 99=35, 99.9=35, 99.99=35] [GCS: Count=2, Max=21, Min=13, Avg=17, 90=21, 99=21, 99.9=21, 99.99=21] [USED_MEM_MB: Count=2, Max=66, Min=40, Avg=53, 90=66, 99=66, 99.9=66, 99.99=66] [CLEANUP: Count=30, Max=776191, Min=1, Avg=25870.77, 90=11, 99=776191, 99.9=776191, 99.99=776191] [UPDATE: Count=32913, Max=538111, Min=31, Avg=1629.4, 90=581, 99=30191, 99.9=242559, 99.99=454655] [GCS_TIME: Count=2, Max=32, Min=16, Avg=24, 90=32, 99=32, 99.9=32, 99.99=32] 
[OVERALL], RunTime(ms), 295507
[OVERALL], Throughput(ops/sec), 8836.47087886243
[TOTAL_GCS_PS_Scavenge], Count, 305
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 519
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.17563035731810075
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 305
[TOTAL_GC_TIME], Time(ms), 519
[TOTAL_GC_TIME_%], Time(%), 0.17563035731810075
[MAX_MEM_USED], MBs, 196
[MIN_MEM_USED], MBs, 16
[MAX_THREADS], Count, 32
[MIN_THREADS], Count, 2
[MAX_SYS_LOAD_AVG], Load, 37.28
[MIN_SYS_LOAD_AVG], Load, 17.34
[THREAD_COUNT], Operations, 31
[THREAD_COUNT], AverageLatency(us), 31.032258064516128
[THREAD_COUNT], MinLatency(us), 2
[THREAD_COUNT], MaxLatency(us), 32
[THREAD_COUNT], 95thPercentileLatency(us), 32
[THREAD_COUNT], 99thPercentileLatency(us), 32
[READ], Operations, 1303873
[READ], AverageLatency(us), 3310.9652504500054
[READ], MinLatency(us), 3
[READ], MaxLatency(us), 1818623
[READ], 95thPercentileLatency(us), 8247
[READ], 99thPercentileLatency(us), 81343
[READ], Return=OK, 1303873
[SYS_LOAD_AVG], Operations, 31
[SYS_LOAD_AVG], AverageLatency(us), 31.548387096774192
[SYS_LOAD_AVG], MinLatency(us), 17
[SYS_LOAD_AVG], MaxLatency(us), 37
[SYS_LOAD_AVG], 95thPercentileLatency(us), 36
[SYS_LOAD_AVG], 99thPercentileLatency(us), 37
[GCS], Operations, 31
[GCS], AverageLatency(us), 9.838709677419354
[GCS], MinLatency(us), 0
[GCS], MaxLatency(us), 23
[GCS], 95thPercentileLatency(us), 21
[GCS], 99thPercentileLatency(us), 23
[USED_MEM_MB], Operations, 31
[USED_MEM_MB], AverageLatency(us), 86.19354838709677
[USED_MEM_MB], MinLatency(us), 16
[USED_MEM_MB], MaxLatency(us), 196
[USED_MEM_MB], 95thPercentileLatency(us), 191
[USED_MEM_MB], 99thPercentileLatency(us), 196
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 25870.766666666666
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 776191
[CLEANUP], 95thPercentileLatency(us), 28
[CLEANUP], 99thPercentileLatency(us), 776191
[UPDATE], Operations, 1307366
[UPDATE], AverageLatency(us), 3402.2590162204006
[UPDATE], MinLatency(us), 29
[UPDATE], MaxLatency(us), 1815551
[UPDATE], 95thPercentileLatency(us), 8271
[UPDATE], 99thPercentileLatency(us), 80127
[UPDATE], Return=OK, 1307366
[GCS_TIME], Operations, 31
[GCS_TIME], AverageLatency(us), 16.741935483870968
[GCS_TIME], MinLatency(us), 0
[GCS_TIME], MaxLatency(us), 65
[GCS_TIME], 95thPercentileLatency(us), 32
[GCS_TIME], 99thPercentileLatency(us), 65